/*
 Localized strings for CFErrors returned by AVFoundationCF.

 When displayed in an alert, the strings whose keys end in _Description will be the alert title.
 The strings whose keys end in _RecoverySuggestion or _FailureReason will be the alert body.
 */

"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_Description" = "Impossibile completare l'azione";
"AVFoundationCFErrorDomain_AVCFErrorOutOfMemory_RecoverySuggestion" = "Riprova più tardi.";

"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_Description" = "Impossibile aprire";
"AVFoundationCFErrorDomain_AVCFErrorFileFormatNotRecognized_FailureReason" = "Questo formato multimediale non è supportato.";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_Description" = "Impossibile aprire";
"AVFoundationCFErrorDomain_AVCFErrorFileFailedToParse_FailureReason" = "Il file multimediale può essere danneggiato.";

"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_Description" = "Impossibile aprire";
"AVFoundationCFErrorDomain_AVCFErrorContentIsProtected_FailureReason" = "L'applicazione non è autorizzata a riprodurre questo file."; /* the file is DRM protected */
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_Description" = "Impossibile aprire";
"AVFoundationCFErrorDomain_AVCFErrorNoImageAtTime_FailureReason" = "Impossibile utilizzare questo file multimediale.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_Description" = "Impossibile decodificare";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_FailureReason" = "Il decodificatore richiesto per questo file multimediale è occupato.";
"AVFoundationCFErrorDomain_AVCFErrorDecoderTemporarilyUnavailable_RecoverySuggestion" = "Interrompi tutte le azioni che decodificano file multimediali e riprova.";
